{
  "profile":{
    "profession":"Softwareentwickler",
    "residence":"Residenz:",
    "city":"Stadt:",
    "age":"Alter:",
    "languages":"Sprachen: ",
    "languages-1":"Spanisch",
    "languages-2":"Englisch",
    "languages-3":"Deutsch",
    "hard-skills":"Schwierige Fähigkeiten:",
    "git-knowledge":"GIT-Kenntnisse",
    "database-knowledge":"Nutzung der SQL/MySQL-Datenbank",
    "scrum-knowledge":"Scrum ",
    "server-infrastructure":"Serverinfrastruktur",
    "linux-knowledge":"Umgang mit Debian-basierten Linux-Distributionen (Kali Linux)",
    "soft-skills":"Soft Skills:",
    "focus-group":"Teamfähigkeit",
    "companionship":"Gesellschaft",
    "dialog":"Dialogfähigkeit",
    "leadership":"Entscheidungsfähigkeit",
    "responsability":"Verantwortung",
    "analisis":"Analyse und Problemlösung",
    "selftaught":"Selbst beigebracht",
    "versatility":"Anpassungsfähigkeit / Vielseitigkeit",
    "download-cv":"Lehrplan herunterladen"
 },

 "home":{
  "software-space":"Softwareentwicklung, <br> Serverarchitektur und mehr ...",
  "about-me":"Über mich",
  "description":"Beschreibung: ",
  "personal-description":"Hallo! Mein Name ist Lucas Nicolás Greco, ich bin ",
  "personal-descriptionn":" Jahre alt und lebe in Zona Norte, Buenos Aires.<br>Ich habe meinen Abschluss als Software-Ingenieur an der National Technological University gemacht. Ich betrachte mich als einen analytischen und organisierten Softwareentwickler, der es gewohnt ist, unter Druck zu arbeiten und nach neuen Erfahrungen und Lernmöglichkeiten im Bereich Programmierung und IT im Allgemeinen zu suchen. Es macht mir Spaß, innovative Ideen zu entwickeln und optimale Lösungen zu finden.<br>Meine Leidenschaft beschränkt sich nicht nur auf das Programmieren, sondern erstreckt sich auch auf andere Bereiche der IT, wie zum Beispiel Cybersicherheit und Serverinfrastruktur. Darüber hinaus verfüge ich über umfangreiche Erfahrung im Hardware-Bereich, da ich mich schon seit einiger Zeit mit dem Bau, der Wartung und der Reparatur von Computern befasse. Andererseits habe ich im Bereich Software durch meine Ausbildung zum Software Engineer Kenntnisse in Sprachen wie C, C++, C#, SQL Server, HTML, CSS und Java erworben.<br>Ich habe Erfahrung im Umgang mit Konzepten und GIT-Praktiken sowie bei der Entwicklung von Anwendungen in mehreren Sprachen, wie unter anderem C, C++, C#, Java (im Back-End) und HTML, CSS, Javascript (im Front-End). Darüber hinaus bin ich mit agilen Methoden vertraut, insbesondere mit Schwerpunkt auf Scrum.<br>Ich freue mich darauf, einen Ort zu finden, an dem ich mein Wissen anwenden, einen Mehrwert schaffen und meine Erfahrung im Bereich Programmierung und IT erweitern kann. Ich bin offen für neue Möglichkeiten und Herausforderungen, die es mir ermöglichen, mich beruflich weiterzuentwickeln.",
  "experience":"Jahre Erfahrung",
  "projects":"Fertige Projekte"
},
  "contact":{
    "contact-information":"Kontakt: ",
    "country":"Staat: ",
    "local-city":"Stadt: ",
    "street":"Straße: ",
    "email":"Email: ",
    "signal-user":"Signal Nickname: ",
    "discord-id":"Discord: ",
    "phone":"Telefonnummer: ",
    "office-phone":"Büro-Telefonnummer: ",
    "cell-phone":"Handynummer: ",
    "social-networks":"In Kontakt kommen: "
},
  "history":{
    "education":"Bildung:",
    "university":"Nationale Technische Universität (UTN – FRGP). ",
    "university-class":"Student",
    "university-date":"Februar 2017 - Juli 2021",
    "university-description":"Es hat etwas länger gedauert, als ich erwartet hatte, da er auch Teilzeit arbeitete und sich gleichzeitig um einige familiäre Probleme kümmerte. Während meines Studiums lernte ich das Programmieren in C, C++, etwas C#, und ein bisschen Java sowie CSS und Javascript für die Front-End-Webanwendungen. Im Jahr 2021 habe ich schließlich meinen Abschluss als Software Programmer Engineer gemacht.",
    "selftaught-studies":"Low-Level-Programmierung (Autodidakt).",
    "selftaught-studies-class":"Student",
    "selftaught-studies-date":"Juli 2017 - Dezember 2017",
    "selftaught-studies-description":"Ich habe an einem Crashkurs teilgenommen, in dem ich mich mit Low-Level-Programmierung befasst habe, die Assembler, Bash, Shell, Batch, und Bat-Scripting, um zu lernen, wie man Dienste automatisiert (Linux), die Leistung optimiert (Windows), und verwalten Sie verschiedene Aufgaben und Ressourcen auf verschiedenen Betriebssystemen.",
    "selftaughtweb":"Webentwicklungskurse (verschiedene). ",
    "selftaughtweb-class":"Student",
    "selftaughtweb-date":"Januar 2018 - Juli 2021",
    "selftaughtweb-description":" ",
    "english":"English(F.C.E.)",
    "english-class":"Student",
    "english-date":"Januar 2016 - Dezember 2016",
    "english-description":"Nachdem ich sechs Jahre lang Englisch gelernt hatte, bereitete ich mich das ganze Jahr auf die Abschlussprüfung zum First Certificate of English vor. ",
    "technician":"Elektromechanischer Techniker (Institut Doctor Juan Segundo Fernández)",
    "technician-class":"Student",
    "technician-date":"März 2009 – Dezember 2015",
    "technician-description":"Ich habe an einer technischen Hochschule studiert, wo ich meinen Abschluss als Elektromechaniker gemacht habe. Gleichzeitig habe ich etwas über Tischlerei, Elektrizität, Low-Level-Programmierung, Automatisierung mit SPS, manuelles Entwerfen von Plänen und mit AutoCAD und 3D-CAD gelernt. Drehmaschinenhandling Parallel-, Fräser-, CNC-Drehmaschinen und Bearbeitungszentrum. Ich habe 2015 meinen Abschluss gemacht, da die Techniker in Argentinien ein weiteres Jahr an der High School absolvieren, um sich beruflich zu spezialisieren. ",
    "certificate":"Qualifikation",
    "work-history":"Berufserfahrung (allgemein):",
    "work-1-position":"JavaScript-Entwickler",
    "work-1-date":"Juli 2021 – Oktober 2022",
    "work-1-description":"Entwickler in JavaScript:<br> - Auf den Kunden zugeschnittene Programmierung und Entwicklung auf einer Webplattform.<br> Esker mit SAP-Integration.<br> - Automatisierung der Auftragsannahme über WEB- und Mobile-Schnittstelle.<br> - Integration mit verschiedenen APIs über SOAP-Webdienste und REST und Integrationen in SAP.<br> - Unterstützung internationaler und nationaler Kunden per Post/Meetings.",
    "work-2-position":"Entwickler/Support",
    "work-2-date":"März 2022 – August 2022",
    "work-2-description":"Entwickler in JavaScript:<br> - Auf den Kunden zugeschnittene Programmierung und Entwicklung auf einer Webplattform.<br>Esker mit SAP-Integration.<br>- Automatisierung der Auftragsannahme über WEB-Schnittstelle.<br>-Esker-Unterstützung für Techdata-Kunden in APAC/EMEA/USA.",
    "work-3-position":"Sekretär des Postgraduiertenbüros / Sekretär des Büros für Fahrzeugtechnik",
    "work-3-date":"Februar 2019 – Oktober 2021",
    "work-3-description":"Büroaufgaben (verschiedene):<br> - Anmeldung der Studierenden.<br> - Überprüfung/Abschluss von Budgets.<br> - Hochladen der Qualifikationen beider Ämter innerhalb des internen Systems der Universität (SYSACAD).<br> - Gerätewartung (Projektoren, Notebooks, Netzwerke).<br> - Wartung von Bürocomputern sowie Installation von Bürosoftware (Office-Suite usw.).",
    "work-4-position":"PC-Reparatur",
    "work-4-date":"Januar 2016 – Juli 2021",
    "work-4-description":"Montage/Reinigung/Wartung von PCs, NAS-Servern, Netzwerkinstallationen.<br>Wartungsaufgaben (verschiedene):<br>- Sicherung/Formatierung von Festplatten.<br>- Betriebssysteminstallation (Windows/Linux).<br>- Windows 10-Optimierung (für Computer mit geringen Ressourcen).<br>- Diagnose und Lösung von Fehlern.<br>- Austausch von Komponenten (Wärmeleitpasten und andere Komponenten).",
    "work-5-position":"Elektromechaniker",
    "work-5-date":"Januar 2015 – Januar 2016",
    "work-5-description":"Elektromechanische Wartung von Industrie-Hochdruckreinigern:<br>- Diagnose und Lösung mechanischer, elektrischer oder anderer Probleme.<br>- Reinigung, Wartung und Austausch von Druckventilen.<br>- Reinigung, Wartung der Kesselanlage.<br>- Wartung und Austausch von SPSen und anderen elektrischen Komponenten."
 },
 "projects":{
  "developments":"Entwicklungen:",
  "description-1":"Abschließende praktische Arbeit zum Thema: Programmierung III. Mit Csharp erstellte E-Commerce-Webseite.",
  "description-2":"Kleines ABML-ähnliches Verwaltungsprogramm in C, erstellt mit Structs, einer Konsolenanwendung mit einer MS-DOS-ähnlichen Schnittstelle.",
  "description-3":"Praktisches Arbeitsmanagementsystem Krankenhaus San Simón.",
  "description-4":"Kleiner Algorithmus, der die Möglichkeit hinzufügt, die Tastaturpfeile als Eingabe für jede Art von Konsolenprogramm mit einer MS-DOS-ähnlichen Oberfläche zu verwenden, die auf Menüs anwendbar ist.",
  "description-5":"Serpent-Spiel in C erstellt, mit einer grafischen Oberfläche auf einer Konsole wie MS-DOS.",
  "description-6":"",
  "description-7":"Verwaltungsprogramm vom Typ ABML zur Verwaltung eines Fahrradladens, erstellt in C++, erstellt mit P.O.O., einer Konsolenanwendung mit einer Schnittstelle vom Typ MS-DOS.",
  "description-8":"Grafik-Engine zum Erstellen grafischer Schnittstellen in der Konsole für Programme, die keine Formulare verwenden, erstellt in C++. Die Schnittstelle ist vom Typ MS-DOS und eignet sich vor allem für Menüs. Klarstellung: Es funktioniert nur auf Windows-Betriebssystemen, da es Bibliotheken und Systemfunktionen aus dem Windows-Cmd verwendet, es funktioniert nicht auf Linux- oder MacOS-Distributionen.",
  "description-9":"Grafik-Engine-Projekt für Ego-Shooter vom Typ Wolfenstein 3d/Doom, erstellt auf der Konsole.",
  "description-10":"Cthulhu OS 1.0 ist ein für maximale Leistung optimiertes und für Programmierer modifiziertes Windows 10. Es verfügt über mehrere Texteditoren, IDEs und vieles mehr. ",
  "description-11":"Windows 10 Debloated 1.0 ist eine Neuversion von Cthulu OS 1.0, aber ohne die für Entwickler hinzugefügte Anpassung werden immer noch die Debloating-Änderungen auf Cthulu OS 1.0 angewendet",
  "description-12":"Hackintosh ist eine ISO des MACXos-Betriebssystems, die beweisen soll, dass Apple-Betriebssysteme auf PC-Hardware ausgeführt werden können. Derzeit wird empfohlen, sie in virtuellen Maschinen zu installieren, da Sie die Datei ändern müssen, um Dual-Boot durchführen zu können vorherige Windows-Installation.",
  "description-13":"Das Illustro-Monitor-Skins-Paket, angepasst an das Windows-Design für Cthulu OS, eine benutzerdefinierte Windows-ISO, die ich erstellt habe.",
  "description-14":"Dies ist ein Monitor-Skin für die Linux-Monitorsoftware Conky Manager 2.",
  "button":"Mehr sehen "
  
},
"languages":{
  "language-selector":"Sprachen:",
  "spanish":"Spanisch",
  "english":"Englisch",
  "german":"Deutsch"
  }
}
