{
  "profile":{
    "profession":"Developer<br>Software Engineer",
    "residence":"Residence:",
    "city":"City:",
    "age":"Age:",
    "languages":"Languages: ",
    "languages-1":"Spanish",
    "languages-2":"English",
    "languages-3":"German",
    "hard-skills":"Technical Skills:",
    "git-knowledge":"Knowledge/handling of repository tools (GIT)",
    "database-knowledge":"Using SQL/MySQL Database",
    "scrum-knowledge":"Scrum Methodologies",
    "server-infrastructure":"Server infrastructure",
    "linux-knowledge":"Handling Debian-based Linux distributions (Kali Linux)",
    "soft-skills":"Soft Skills:",
    "focus-group":"Teamwork",
    "companionship":"Companionship",
    "dialog":"Dialog Capability",
    "leadership":"Decision-making ability",
    "responsability":"Responsibility",
    "analisis":"Analysis and problem solving",
    "selftaught":"Self-taught",
    "versatility":"Adaptability / Versatility",
    "download-cv":"Download CV"
 },

 "home":{
  "software-space":"Software development, <br>server architecture and more...",
  "about-me":"About me",
  "description":"Description: ",
  "personal-description":"Hello! My name is Lucas Nicolás Greco, I have ",
  "personal-descriptionn":" years old and I live in Zona Norte, Buenos Aires.<br>I graduated as a Software Engineer from the National Technological University. I consider myself an analytical and organized Software developer, used to working under pressure and looking for new experiences and learning in the field of programming and IT in general. I enjoy coming up with innovative ideas and finding optimal solutions.<br>My passion is not limited to programming, but also covers other areas of IT, such as cybersecurity and server infrastructure. In addition, I have extensive experience in hardware, having been involved in the building, maintenance and repair of computers for a while. On the other hand, in the field of software, my training as a Software Engineer gave me knowledge in languages such as C, C++, C#, SQL Server, HTML, CSS and Java.<br>I have experience in the use of concepts and GIT practices, as well as in the development of applications in several languages, such as C, C++, C#, Java (in the back-end) and HTML, CSS, Javascript (in the front-end), among others. In addition, I am familiar with Agile methodologies, especially focused on Scrum.<br>I am excited to find a place where I can apply my knowledge, add value and expand my experience in the field of programming and IT. I am open to new opportunities and challenges that allow me to continue growing professionally.",
  "experience":"years of experience",
  "projects":"Finished projects"
},
  "contact":{
    "contact-information":"Contact: ",
    "country":"Country: ",
    "local-city":"City: ",
    "street":"Address: ",
    "email":"Email: ",
    "signal-user":"Signal Username: ",
    "discord-id":"Discord: ",
    "phone":"Phone: ",
    "office-phone":"Office: ",
    "cell-phone":"Personal Cell Phone: ",
    "social-networks":"Networks: "
},
  "history":{
    "education":"Education:",
    "university":"National Technical University (UTN - FRGP). ",
    "university-class":"Student",
    "university-date":"February 2017 - July 2021",
    "university-description":"It took a bit longer than I anticipated, as I was also working part-time while dealing with some family issues. During my time at university I learned to program in C, C++, some C#, and a bit of Java, as well as CSS and Javascript for the front-end web applications. I finally graduated as a Software Programmer Engineer in 2021.",
    "selftaught-studies":"Low-level programming (self-taught)",
    "selftaught-studies-class":"Student",
    "selftaught-studies-date":"July 2017 - Dec 2017",
    "selftaught-studies-description":"I took a crash course investigating low-level programming that included assembler, Bash, shell, batch, and bat scripting, to learn how to automate services (Linux), optimize performance (Windows), and manage different tasks and resources on different operating systems.",
    "selftaughtweb":"Web development courses (Various). ",
    "selftaughtweb-class":"Student",
    "selftaughtweb-date":"January 2018 - July 2021",
    "selftaughtweb-description":" ",
    "english":"English(F.C.E.)",
    "english-class":"Student",
    "english-date":"January 2016 - December 2016",
    "english-description":"After 6 years of studying English, I took the whole year to prepare for the First Certificate of English final exam. ",
    "technician":"Electro-Mechanical Technician (Doctor Juan Segundo Fernández Institute)",
    "technician-class":"Student",
    "technician-date":"March 2009 - December 2015",
    "technician-description":"I studied in a technical high school where I graduated as an electro-mechanical technician, in the same I learned about Carpentry, Electricity, Low-level programming, Automation with PLC's, Design of plans by hand and with AutoCAD and 3D CAD , Operation of parallel lathe, milling cutter, CNC lathes and machining center. I graduated in 2015 since in Argentina the technicians do 1 more year of high school to finish specializing professionally. ",
    "technician-certificate":"Title",
    "work-history":"Work experience (in general):",
    "work-1-position":"JavaScript Developer",
    "work-1-date":"July 2021 - October 2022",
    "work-1-description":"JavaScript Developer:<br> - Programming and development tailored to the client on the Esker web platform with integration with SAP. <br> - Automation of order taking via WEB and Mobile interface. <br > - Integration with different APIs through SOAP and REST web services, and integrations to SAP.<br> - Support to international and national clients via mail/meetings.",
    "work-2-position":"Developer/Support",
    "work-2-date":"March 2022 - August 2022",
    "work-2-description":"JavaScript developer: <br> - Custom programming and development on the web platform <br> Esker with integration with SAP. <br> - Automation of order taking via WEB interface <br > -Esker support to Techdata customers in APAC/EMEA/USA",
    "work-3-position":"Secretary of the Postgraduate Office / Secretary of the Automotive Engineering office",
    "work-3-date":"February 2019 - October 2021",
    "work-3-description":"Office tasks (Various): <br> - Registration of students. <br> - Verification/closing of budgets. <br> - Uploading notes from both offices within the internal system of the faculty (SYSACAD). <br> - Maintenance of equipment (Projectors, Notebooks, Networks) <br> - Maintenance of office computers as well as installation of office software (Office suite, etc.). ",
    "work-4-position":"PC Repair",
    "work-4-date":"January 2016 - July 2021",
    "work-4-description":"Assembling/cleaning/Maintenance of PCs, NAS Servers, Network installations.<br> Maintenance tasks (Various): <br> - Backup/formatting of hard drives. <br> - Installation OS (Windows/Linux).<br> - Windows 10 optimization (For low-resource computers).<br> - Diagnosis and solution of errors.<br> - Change of components (Thermal pastes, and other components). ",
    "work-5-position":"Electromechanical Technician",
    "work-5-date":"January 2015 - January 2016",
    "work-5-description":"Electro-mechanical Maintenance of Industrial Pressure Washers: <br> - Diagnosis and solution of mechanical, electrical, or other problems. <br> - Cleaning, maintenance and change of pressure valves. < br> - Cleaning, maintenance of the boiler system.<br> - Maintenance and change of PLC's and other electrical components. "
 },
 "projects":{
  "developments":"Developments:",
  "description-1":"Final project work of the subject: Programming III. Ecommerce type web page made with Csharp.",
  "description-2":"Small ABML-like management program in C, made with structs, a console application that has an MS-DOS-like interface.",
  "description-3":"University project management system Hospital San Simón.",
  "description-4":"Small algorithm that adds the possibility of using the keyboard arrows as input for any type of console program with an MS-DOS-like interface applicable to menus.",
  "description-5":"Serpent Game made in C, with a graphical interface on a console like MS-DOS.",
  "description-6":"",
  "description-7":"ABML-type management program for managing a bicycle store made in C++, made with P.O.O., a console application that has an MS-DOS-like interface.",
  "description-8":"Graphic engine to create graphic interfaces in the console for programs that do not use forms, done in C++. The interface is MS-DOS type, applicable above all to menus. Clarification: it only works on Windows operating systems, since it uses libraries and system functions from the Windows cmd, it does not work on any Linux or MacOS distribution.",
  "description-9":"Graphic engine project for 1st person shooter, Wolfenstein 3d/Doom type made on console",
  "description-10":"Cthulu OS 1.0 is a Windows 10 Optimized for maximum performance and modified for programmers. It has several text editors, IDE's, and much more. ",
  "description-11":"Windows 10 Debloated 1.0 is a blank version of Cthulu OS 1.0 but without the customization that was added for developers, it still has the debloating modifications applied to Cthulu OS 1.0 .",
  "description-12":"Hackintosh is an ISO of the MACXos operating system, dedicated to proving that apple OS's can be run on PC hardware, for the moment it is recommended to install it in virtual machines at the moment since to be able to dual boot you have to modify the previous windows installation.",
  "description-13":"The illustro monitor package of skins, customized to match the windows theme for Cthulu OS, a custom windows Iso that I created.",
  "description-14":"This is a monitor skin for the linux monitor software Conky manager 2.",
  "button":"See more "
}
}
