{
  "profile":{
     "profession":"Desarrollador<br>Técnico programador",
     "residence":"Residencia:",
     "city":"Ciudad:",
     "age":"Edad:",
     "languages":"Idiomas: ",
     "languages-1":"Español",
     "languages-2":"Inglés",
     "languages-3":"Alemán",
     "hard-skills":"Habilidades Técnicas:",
     "git-knowledge":"Conocimiento/manejo de herramientas de repositorios (GIT)",
     "database-knowledge":"Uso de SQL/MySQL Database",
     "scrum-knowledge":"Metodologias Scrum",
     "server-infrastructure":"Infraestructura de servidores",
     "linux-knowledge":"Manejo de distribuciones Linux basadas en Debian (Kali Linux)",
     "soft-skills":"Soft Skills:",
     "focus-group":"Trabajo en equipo",
     "companionship":"Compañerismo",
     "dialog":"Capacidad de Dialogo",
     "leadership":"Capacidad de toma de decisiones",
     "responsability":"Responsabilidad",
     "analisis":"Análisis y resolución de problemas",
     "selftaught":"Autodidacta",
     "versatility":"Adaptabilidad/ Versatibilidad",
     "download-cv":"Descargar CV"
  },
  "home":{
     
     "software-space":"Desarrollo de software, arquitectura <br>de servidores y más... ",
     "about-me":"Sobre mí",
     "description":"Descripción: ",
     "personal-description":"¡Hola! Mi nombre es Lucas Nicolás Greco , tengo ",
     "personal-descriptionn":"  años y vivo en Zona Norte, Buenos Aires.<br>Soy graduado de Técnico Universitario en Programación de la Universidad Tecnológica Nacional. Me considero un desarrollador analítico y organizado, acostumbrado a trabajar bajo presión y en busca de nuevas experiencias y aprendizajes en el campo de la programación y los sistemas en general. Disfruto proponer ideas innovadoras y encontrar soluciones óptimas.<br>Mi pasión no se limita solo a la programación, sino que también abarca otras áreas de los sistemas, como la ciberseguridad y la infraestructura de servidores. Además, tengo una amplia experiencia en hardware, ya que durante un tiempo me dediqué al ensamblaje, mantenimiento y reparación de computadoras. Por otro lado, en el ámbito del software, mi formación como Técnico Universitario en Programación, me proporcionó conocimientos en lenguajes como C, C++, C#, SQL Server, HTML, CSS y Java.<br>Tengo experiencia en el uso de conceptos y prácticas de GIT, así como en el desarrollo de aplicaciones en varios lenguajes, como C, C++, C#, Java (en el back-end) y HTML, CSS, Javascript (en el front-end), entre otros. Además, estoy familiarizado con metodologías Agile, especialmente enfocadas en Scrum.<br>Estoy entusiasmado por encontrar un lugar donde pueda aplicar mis conocimientos, aportar valor y expandir mi experiencia en el campo de la programación y los sistemas. Estoy abierto a nuevas oportunidades y desafíos que me permitan seguir creciendo profesionalmente.",
     "experience":"años de experiencia",
     "projects":"Proyectos terminados"
  },
  "history":{
   "education":"Educación:",
   "university":"Universidad Técnica Nacional(UTN - FRGP). ",
   "university-class":"Estudiante",
   "university-date":"Febrero 2017 - Julio 2021",
   "university-description":"Tardó un poco más de lo que anticipé,ya que también estaba trabajando a tiempo parcial mientras lidiaba con algunos problemas familiares. Durante mi tiempo en la universidad aprendí a programar en C, C++, algo de C#, y un poco de Java, así como CSS y Javascript para las aplicaciones web front-end. Finalmente me gradué como Ingeniero Programador de Software en 2021.",
   "selftaught-studies":"Programación de bajo nivel (autodidacta).",
   "selftaught-studies-class":"Estudiante",
   "selftaught-studies-date":"Julio 2017 - Dic 2017",
   "selftaught-studies-description":"Tomé un curso acelerado investigando programación de bajo nivel que incluía ensamblador, Bash, shell, lote, y bat scripting, para aprender a automatizar servicios (Linux), optimizar el rendimiento (Windows),y administrar diferentes tareas y recursos en diferentes sistemas operativos. ",
   "selftaughtweb":"Cursos de desarrollo Web(Varios). ",
   "selftaughtweb-class":"Estudiante",
   "selftaughtweb-date":"Enero 2018 - julio 2021",
   "selftaughtweb-description":" ",
   "english":"Inglés(F.C.E.)",
   "english-class":"Estudiante",
   "english-date":"Enero 2016 - Diciembre 2016",
   "english-description":"Después de 6 años de estudiar inglés, me tomé todo el año para prepararme para el examen final del First Certificate of English. ",
   "technician":"Técnico Electro-Mecánico(Instituto Doctor Juan Segundo Fernández)",
   "technician-class":"Estudiante",
   "technician-date":"Marzo 2009 - Diciembre 2015",
   "technician-description":"Estudié en un secudario tecnico donde me recibí de técnico electro-mecánico,en el mismo aprendi sobre Carpinteria, Electricidad, Programación de bajo nivel, Automatismos con PLC's, Diseño de planos a mano y con AutoCAD y CAD 3D, Manejo de torno paralelo,Fresa, Tornos  CNC y centro de mecanizado. Me recibí en 2015 ya que en argentina los técnicos hacen 1 año mas de secundario para terminar de especializarse profecionalmente. ",
   "technician-certificate":"Título",
   "work-history":"Experiencia laboral (en general):",
   "work-1-position":"Desarrollador en JavaScript",
   "work-1-date":"Julio 2021 - Octubre 2022",
   "work-1-description":"Desarrollador en JavaScript:<br> - Programación y desarrollo a medida del cliente sobre plataforma web Esker con integración con SAP. <br> - Automatización de toma de pedidos vía interfaz WEB y Mobile. <br> - Integración con diferentes APIs a través de web services SOAP y REST, e integraciones a SAP.<br> - Soporte a clientes internacionales y nacionales vía mail/reuniones.",
   "work-2-position":"Desarrollador/soporte",
   "work-2-date":"Marzo 2022 - Agosto 2022",
   "work-2-description":"Desarrollador en JavaScript: <br> - Programación y desarrollo a medida del cliente sobre plataforma web <br> Esker con integración con SAP. <br> - Automatización de toma de pedidos vía interfaz WEB <br> -Soporte de Esker a clientes de Techdata en APAC/EMEA/USA",
   "work-3-position":"Secretario de la oficina de Posgrados / Secretario de la oficina de Ingenieria Automotriz",
   "work-3-date":"Febrero 2019 - Octubre 2021",
   "work-3-description":"Tareas de oficina (Varias): <br> - Alta de alumnos. <br> - Verificacion/cierre de presupuestos. <br> - Carga de notas de ambas oficinas dentro del sistema interno de la facultad(SYSACAD). <br> - Mantenimiento de los equipos(Proyectores,Notebooks,Redes) <br> - Mantenimiento de la computadoras de la oficina asi como tambien Instalacion de software de oficina (suite de Office, etc.). ",
   "work-4-position":"Reparación de PC's",
   "work-4-date":"Enero 2016 - Julio 2021",
   "work-4-description":"Armado/limpieza/Mantenimiento de Pc's, NAS Servers, Instalaciones de red.<br> Tareas de mantenimiento (Varias): <br> - Backup/formateo de discos duros. <br> - Instalacion de SO(Windows/Linux).<br> - Optimizacion de windows 10(Para computadores de bajos recursos).<br> - Diagnostico y solucion de errores. <br> - Cambio de componentes(Pastas termicas, y otros componentes). ",
   "work-5-position":"Tecnico Electromecánico",
   "work-5-date":"Enero 2015 - Enero 2016",
   "work-5-description":"Mantenimiento electro-mecánico de Hidrolavadoras Industriales: <br> - Diagnostico y solucion de problemas Mecanicos, electricos, o de otra índole. <br> - Limpieza, mantenimiento y cambio de Valvulas de presion. <br> - Limpieza, mantenimiento de sistema de calderas.<br> - Mantenimiento y cambio de PLC's y otros componentes electricos. "
},
"contact":{
   "contact-information":"Contacto: ",
   "country":"País: ",
   "local-city":"Ciudad: ",
   "street":"Dirección: ",
   "email":"E-mail: ",
   "signal-user":"Nombre de usuario de Signal: ",
   "discord-id":"Discord: ",
   "phone":"Teléfono: ",
   "office-phone":"Oficina: ",
   "cell-phone":"Teléfono Celular Personal: ",
   "social-networks":"Redes: "
},

"projects":{
   "developments":"Desarrollos:",
   "description-1":"Trabajo práctico Final de la materia: Programacion III. Pagina web tipo ecommerce hecha con Csharp.",
   "description-2":"Pequeño programa de gestion tipo ABML en C ,hecho con structs, una aplicacion de consola que posee una interfaz tipo MS-DOS.",
   "description-3":"Trabajo práctico sistema de gestión Hospital San Simón.",
   "description-4":"Pequeño algoritmo que agrega la posibilidad de usar las flechas del teclado como input para cualquier tipo de programa de consola con interfaz tipo MS-DOS aplicable a menus.",
   "description-5":"Serpent Game hecho en C, con interfaz grafica en consola tipo MS-DOS.",
   "description-6":"",
   "description-7":"Programa de gestion tipo ABML de gestion de un local de bicicletas hecho en C++ ,hecho con P.O.O., una aplicacion de consola que posee una interfaz tipo MS-DOS",
   "description-8":"Motor gráfico para crear interfaces graficas en la consola para programas que no utilizan forms, hecho en C++. La interfaz es tipo MS-DOS aplicable sobretodo a menus. Aclaración: solo funciona en sistemas operativos de Windows, ya que utiliza librerias y funciones de sistema del cmd de Windows, no funciona en ninguna distribucion de Linux o MacOS.",
   "description-9":"Proyecto de motor grafico para shooter en 1ra persona, tipo Wolfenstein 3d/Doom hecho en consola",
   "description-10":"Cthulu OS 1.0 es un windows 10 Optimizado para el maximo rendimiento y modificado para programadores.Cuenta con varios editores de texto, IDE's, y mucho más. ",
   "description-11":"Windows 10 Debloated 1.0  es una version virgen de Cthulu OS 1.0 pero sin la customizacion que se le agrego para programadores, aun asi cuenta con las modificaciones de debloating aplicadas a Cthulu OS 1.0",
   "description-12":"Hackintosh es una ISO del sistema operativo MACXos, dedicada a probar que se puede correr S.O's de apple en hardware de PC, el mismo por el momento se recomienda instalar en maquinas virtuales por el momento ya que para poder hacer dual boot hay que modificar la instalacion de windows previa.",
   "description-13":"The illustro monitor package of skins, customized to match the windows theme for Cthulu OS, a custom windows Iso that I created.",
   "description-14":"This is a monitor skin for the linux monitor software Conky manager 2.",
   "button":"Ver más "
   
}
}
